program Project1;

{$APPTYPE CONSOLE}

{$R *.res}

uses
    System.SysUtils;

{*------------------------------------------------------------------------------

思想

  面向过程
     强调的是功能行为(方法、函数),C语言就是面向过程语言

  基于对象

  面向对象
     将功能封装进对象，强调具备了功能的对象。

类和对象关系

    简单的说类就是将某一类事物中所有的共同点抽离出来,形成一个模板,而这个模板我们在编程中称为类

    对象是按照模板生产(制造)出来的一个具体的事物

类和类之间的关系

    抽象 ：将同类事物向上抽取的过程

    派生(继承) ：我们编程中的继承指的是类和类之间的关系，称为派生更合适：纲、门、界、数

    封装：将不必要暴露的细节隐藏起来

    多态：一类事物以多种形态存在


-------------------------------------------------------------------------------}
type
    TSutdent = class

    end;

begin

end.

